import './PrivacyPolicyPage.css';

export default function PrivacyPolicyPage() {
  return (
    <section className="privacy-page">
      <div className="privacy-page__container">
        <h1>Политика конфиденциальности</h1>
        <p>
        Настоящая Политика конфиденциальности (далее — Политика) разработана в соответствии с Федеральным законом № 152-ФЗ «О персональных данных» и определяет порядок обработки, хранения и защиты информации о физических лицах, использующих сайт компании Aira (далее — Оператор).
         Мы уважаем ваше право на неприкосновенность личной информации и соблюдаем требования
          законодательства Российской Федерации в области персональных данных.
        </p>

        <h2>1. Какие данные мы собираем</h2>
        <p>
          При оформлении заказа и использовании личного кабинета мы можем получать: фамилию, имя, отчество, номер
          телефона, адрес электронной почты, адрес доставки, файлы cookies, а также сведения о заказах.
        </p>

        <h2>2. Цели обработки персональных данных</h2>
        <p>Ваши данные используются исключительно для:</p>
        <ul>
          <li>оформления, подтверждения и выполнения заказов;</li>
          <li>связи с вами по вопросам доставки, оплаты и обслуживания;</li>
          <li>исполнения обязательств по гарантийному и сервисному обслуживанию;</li>
          <li>улучшения качества сервиса и клиентской поддержки.</li>
        </ul>

        <h2>3. Передача данных третьим лицам</h2>
        <p>
          Мы не передаем персональные данные третьим лицам, за исключением случаев, необходимых для исполнения заказа
          (например, курьерским службам), а также случаев, прямо предусмотренных законодательством.
        </p>

        <h2>4. Срок хранения данных</h2>
        <p>
          Персональные данные хранятся не дольше, чем этого требуют цели обработки и требования законодательства, после
          чего удаляются или обезличиваются.
        </p>

        <h2>5. Защита информации</h2>
        <p>
          Мы применяем организационные и технические меры для защиты персональных данных от несанкционированного
          доступа, изменения, утраты и распространения.
        </p>

        <h2>6. Права пользователя</h2>
        <p>
          Вы вправе запросить уточнение, обновление или удаление персональных данных, а также отозвать согласие на их
          обработку, направив обращение в службу поддержки.
        </p>

        <h2>7. Контакты</h2>
        <p>
          По вопросам обработки персональных данных вы можете обратиться по телефону +7 (4912) 12-34-56 или через
          электронную почту info@aira.ru
        </p>
      </div>
    </section>
  );
}

